psql_scripts/sample_scripts/pgbench-scripts/pgbench_run_summary.txt
pgbench (18.0)
transaction type: multiple scripts
scaling factor: 1
query mode: simple
number of clients: 10
number of threads: 1
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 13208
number of failed transactions: 0 (0.000%)
latency average = 22.583 ms
latency stddev = 41.053 ms
initial connection time = 187.585 ms
tps = 441.738155 (without initial connection time)
SQL script 1: gen-inventory.sql
 - weight: 10 (targets 32.3% of total)
 - 4314 transactions (32.7% of total)
 - number of transactions actually processed: 4314 (tps = 144.280618)
 - number of failed transactions: 0 (0.000%)
 - latency average = 12.862 ms
 - latency stddev = 29.475 ms
SQL script 2: gen-sales-transactions.sql
 - weight: 4 (targets 12.9% of total)
 - 1744 transactions (13.2% of total)
 - number of transactions actually processed: 1744 (tps = 58.327630)
 - number of failed transactions: 0 (0.000%)
 - latency average = 23.993 ms
 - latency stddev = 58.636 ms
SQL script 3: delete-sales-transaction-line.sql
 - weight: 1 (targets 3.2% of total)
 - 407 transactions (3.1% of total)
 - number of transactions actually processed: 407 (tps = 13.612010)
 - number of failed transactions: 0 (0.000%)
 - latency average = 32.322 ms
 - latency stddev = 65.534 ms
SQL script 4: update-customer.sql
 - weight: 4 (targets 12.9% of total)
 - 1714 transactions (13.0% of total)
 - number of transactions actually processed: 1714 (tps = 57.324288)
 - number of failed transactions: 0 (0.000%)
 - latency average = 14.617 ms
 - latency stddev = 26.488 ms
SQL script 5: select-customer.sql
 - weight: 6 (targets 19.4% of total)
 - 2603 transactions (19.7% of total)
 - number of transactions actually processed: 2603 (tps = 87.056664)
 - number of failed transactions: 0 (0.000%)
 - latency average = 8.036 ms
 - latency stddev = 19.233 ms
SQL script 6: top-customers.sql
 - weight: 2 (targets 6.5% of total)
 - 784 transactions (5.9% of total)
 - number of transactions actually processed: 784 (tps = 26.220678)
 - number of failed transactions: 0 (0.000%)
 - latency average = 21.712 ms
 - latency stddev = 29.675 ms
SQL script 7: top-selling-products.sql
 - weight: 4 (targets 12.9% of total)
 - 1642 transactions (12.4% of total)
 - number of transactions actually processed: 1642 (tps = 54.916267)
 - number of failed transactions: 0 (0.000%)
 - latency average = 76.003 ms
 - latency stddev = 35.903 ms