psql_scripts/sample_scripts/pgbench-scripts/pgbench_run_summary.txt
pgbench (18.0)
transaction type: multiple scripts
scaling factor: 1
query mode: simple
number of clients: 10
number of threads: 1
maximum number of tries: 1
duration: 1200 s
number of transactions actually processed: 72852
number of failed transactions: 0 (0.000%)
latency average = 164.710 ms
latency stddev = 300.440 ms
initial connection time = 253.927 ms
tps = 60.700234 (without initial connection time)
SQL script 1: gen-inventory.sql
 - weight: 10 (targets 32.3% of total)
 - 23407 transactions (32.1% of total)
 - number of transactions actually processed: 23407 (tps = 19.502696)
 - number of failed transactions: 0 (0.000%)
 - latency average = 33.532 ms
 - latency stddev = 40.906 ms
SQL script 2: gen-sales-transactions.sql
 - weight: 4 (targets 12.9% of total)
 - 9444 transactions (13.0% of total)
 - number of transactions actually processed: 9444 (tps = 7.868734)
 - number of failed transactions: 0 (0.000%)
 - latency average = 49.072 ms
 - latency stddev = 44.482 ms
SQL script 3: delete-sales-transaction-line.sql
 - weight: 1 (targets 3.2% of total)
 - 2457 transactions (3.4% of total)
 - number of transactions actually processed: 2457 (tps = 2.047171)
 - number of failed transactions: 0 (0.000%)
 - latency average = 258.506 ms
 - latency stddev = 78.938 ms
SQL script 4: update-customer.sql
 - weight: 4 (targets 12.9% of total)
 - 9380 transactions (12.9% of total)
 - number of transactions actually processed: 9380 (tps = 7.815409)
 - number of failed transactions: 0 (0.000%)
 - latency average = 39.079 ms
 - latency stddev = 42.736 ms
SQL script 5: select-customer.sql
 - weight: 6 (targets 19.4% of total)
 - 14110 transactions (19.4% of total)
 - number of transactions actually processed: 14110 (tps = 11.756442)
 - number of failed transactions: 0 (0.000%)
 - latency average = 18.879 ms
 - latency stddev = 31.048 ms
SQL script 6: top-customers.sql
 - weight: 2 (targets 6.5% of total)
 - 4683 transactions (6.4% of total)
 - number of transactions actually processed: 4683 (tps = 3.901872)
 - number of failed transactions: 0 (0.000%)
 - latency average = 190.447 ms
 - latency stddev = 61.863 ms
SQL script 7: top-selling-products.sql
 - weight: 4 (targets 12.9% of total)
 - 9371 transactions (12.9% of total)
 - number of transactions actually processed: 9371 (tps = 7.807910)
 - number of failed transactions: 0 (0.000%)
 - latency average = 916.787 ms
 - latency stddev = 127.259 ms